app/controllers/message_groups_controller.rb

SELECT "message_groups".* FROM "message_groups"
---
  def index
    @current_user = current_user
    redirect_to '/signin' unless @current_user

    @message_groups = MessageGroup.all

SELECT "message_groups".* FROM "message_groups" WHERE "message_groups"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "message_groups".* FROM "message_groups"
---
  def show
    @current_user = current_user
    @message_group = MessageGroup.find(params[:id])
    @message_groups = MessageGroup.all

INSERT INTO "message_groups" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "sdf"], ["created_at", "2023-02-26 08:46:19.479808"], ["updated_at", "2023-02-26 08:46:19.479808"]]
---
  def create
    @message_group = MessageGroup.create(name: params["message_group"]["name"])